# Merge  and joints using pandas

In [1]:
import pandas as pd

In [60]:
a = pd.DataFrame({"Name":["Swathi","Swetha","Swapana","Srinidhi","Srilekha"],"Registered_Id":[1,2,3,4,5],"Job_Role":["Assistant","Teamlead","Consultant","Manager","HR"]})
a

       Name  Registered_Id    Job_Role
0    Swathi              1   Assistant
1    Swetha              2    Teamlead
2   Swapana              3  Consultant
3  Srinidhi              4     Manager
4  Srilekha              5          HR

In [61]:
b = pd.DataFrame({"Name":["kavya","Shanthi","Vidhya","Vimala","kokila"],"Registered_Id":[1,2,3,4,5],"Job_Role":["Accountant","Teamlead","HR","Manager","CEO"]})
b

      Name  Registered_Id    Job_Role
0    kavya              1  Accountant
1  Shanthi              2    Teamlead
2   Vidhya              3          HR
3   Vimala              4     Manager
4   kokila              5         CEO

In [62]:
# Merge
pd.merge(a,b,on="Registered_Id")

     Name_x  Registered_Id  Job_Role_x   Name_y  Job_Role_y
0    Swathi              1   Assistant    kavya  Accountant
1    Swetha              2    Teamlead  Shanthi    Teamlead
2   Swapana              3  Consultant   Vidhya          HR
3  Srinidhi              4     Manager   Vimala     Manager
4  Srilekha              5          HR   kokila         CEO

In [63]:
#Merge Two DataFrames on Multiple Keys
pd.merge(a,b,on = ["Registered_Id","Job_Role"])

     Name_x  Registered_Id  Job_Role   Name_y
0    Swetha              2  Teamlead  Shanthi
1  Srinidhi              4   Manager   Vimala

## Left Join

In [68]:
print(pd.merge(a,b, on='Job_Role', how='left'))

     Name_x  Registered_Id_x    Job_Role   Name_y  Registered_Id_y
0    Swathi                1   Assistant      NaN              NaN
1    Swetha                2    Teamlead  Shanthi              2.0
2   Swapana                3  Consultant      NaN              NaN
3  Srinidhi                4     Manager   Vimala              4.0
4  Srilekha                5          HR   Vidhya              3.0

## Right Join

In [69]:
print(pd.merge(a,b, on='Job_Role', how='right'))

     Name_x  Registered_Id_x    Job_Role   Name_y  Registered_Id_y
0       NaN              NaN  Accountant    kavya                1
1    Swetha              2.0    Teamlead  Shanthi                2
2  Srilekha              5.0          HR   Vidhya                3
3  Srinidhi              4.0     Manager   Vimala                4
4       NaN              NaN         CEO   kokila                5

## Outer Join

In [70]:
print(pd.merge(a,b, on='Job_Role', how='outer'))

     Name_x  Registered_Id_x    Job_Role   Name_y  Registered_Id_y
0    Swathi              1.0   Assistant      NaN              NaN
1    Swetha              2.0    Teamlead  Shanthi              2.0
2   Swapana              3.0  Consultant      NaN              NaN
3  Srinidhi              4.0     Manager   Vimala              4.0
4  Srilekha              5.0          HR   Vidhya              3.0
5       NaN              NaN  Accountant    kavya              1.0
6       NaN              NaN         CEO   kokila              5.0

## Inner Join

In [71]:
print(pd.merge(a,b, on='Job_Role', how='inner'))

     Name_x  Registered_Id_x  Job_Role   Name_y  Registered_Id_y
0    Swetha                2  Teamlead  Shanthi                2
1  Srinidhi                4   Manager   Vimala                4
2  Srilekha                5        HR   Vidhya                3